Repository: itsafzalbe/PersonalFinanceTracker
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Recipient Gets
uz: Qabul qiluvchi oladi

source: Exchange Rate
uz: Valyuta kursi

source: Conversion
uz: Konvertatsiya

source: New Balances After Transfer
uz: Transferdan keyin yangi qoldiqlar

source: Description (Optional)
uz: Tavsif (ixtiyoriy)

source: Complete Transfer
uz: To'liq uzatish

source: Transfer Tips
uz: O'tkazish bo'yicha maslahatlar

source: Transfer between ANY currencies! USD → UZS, EUR → USD, UZS → EUR, etc.
uz: HAR QANDAY valyutalar o'rtasida o'tkazma! AQSH dollari → so‘m, evro → AQSH dollari, so‘m → yevro va h.k.

source: Automatic Conversion
uz: Avtomatik konvertatsiya

source: We'll convert at the current exchange rate automatically.
uz: Biz avtomatik ravishda joriy kurs bo'yicha konvertatsiya qilamiz.

source: Live Preview
uz: Jonli ko‘rish

source: See exactly how much will be received before confirming.
uz: Tasdiqlashdan oldin aniq qancha olinishini ko'ring.

source: Instant Transfer
uz: Bir zumda uzatish

source: Money moves between your cards immediately.
uz: Pul darhol kartalaringiz o'rtasida o'tadi.

source: Supported Currency Transfers
uz: Qo'llab-quvvatlanadigan valyuta o'tkazmalari

source: and any other currency combination!
uz: va boshqa har qanday valyuta kombinatsiyasi!

source: Transfer Details
uz: Transfer tafsilotlari

source: Transfer Flow
uz: Transfer oqimi

source: Amount Sent
uz: Yuborilgan miqdor

source: Rate
uz: Baho

source: Amount Received
uz: Qabul qilingan miqdor

source: Transfer Information
uz: Ma'lumot uzatish

source: Transfer ID
uz: Transfer identifikatori

source: Time
uz: Vaqt

source: Completed
uz: Bajarildi

source: Exchange Details
uz: Tafsilotlarni almashish

source: Transfer History
uz: Transfer tarixi

source: Card Transfers
uz: Karta o'tkazmalari

source: History of all your card-to-card transfers
uz: Barcha kartadan kartaga o'tkazmalaringiz tarixi

source: New Transfer
uz: Yangi transfer

source: Total Transfers
uz: Jami transferlar

source: Total Amount
uz: Umumiy hisob

source: Received
uz: Qabul qilingan

source: No Transfers Yet
uz: Hozircha transferlar yo'q

source: You haven't made any card-to-card transfers yet.
uz: Siz hali kartadan kartaga oʻtkazmalarni amalga oshirmagansiz.

source: Make Your First Transfer
uz: Birinchi transferingizni amalga oshiring

source: Messages
uz: Xabarlar

source: Site Maps
uz: Sayt xaritalari

source: Static Files
uz: Statik fayllar

source: Syndication
uz: Sindikatsiya

source: That page number is not an integer
uz: Bu sahifa raqami butun son emas

source: That page number is less than 1
uz: Bu sahifa raqami 1 dan kichik

source: That page contains no results
uz: Bu sahifada hech qanday natija yoʻq

source: Enter a valid value.
uz: Yaroqli qiymat kiriting.

source: Enter a valid domain name.
uz: Yaroqli domen nomini kiriting.

source: Enter a valid URL.
uz: Yaroqli URL manzilini kiriting.

source: Enter a valid integer.
uz: Yaroqli butun son kiriting.

source: Enter a valid email address.
uz: Yaroqli elektron pochta manzilini kiriting.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
uz: Harflar, raqamlar, pastki chiziq yoki defislardan iborat haqiqiy "slug"ni kiriting.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
uz: Unicode harflari, raqamlari, pastki chiziq yoki defislardan iborat to'g'ri "slug" kiriting.

source: Enter a valid %(protocol)s address.
uz: Yaroqli %(protocol)s manzilini kiriting.

source: IPv4 or IPv6
uz: IPv4 yoki IPv6

source: Enter only digits separated by commas.
uz: Faqat vergul bilan ajratilgan raqamlarni kiriting.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
uz: Bu qiymat %(cheklangan_qiymat)s ekanligiga ishonch hosil qiling (u %(show_value)s). %(limit_value)s

source: Ensure this value is less than or equal to %(limit_value)s.
uz: Bu qiymat %(limit_value)s dan kichik yoki teng ekanligiga ishonch hosil qiling.

source: Ensure this value is greater than or equal to %(limit_value)s.
uz: Bu qiymat %(limit_value)s dan katta yoki teng ekanligiga ishonch hosil qiling.

source: Ensure this value is a multiple of step size %(limit_value)s.
uz: Bu qiymat qadam kattaligi %(cheklangan_value)s ning karrali ekanligiga ishonch hosil qiling. %(limit_value)s

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
uz: Bu qiymat %(offset)s dan boshlab qadam kattaligi %(cheklangan_value)s ning karrali ekanligiga ishonch hosil qiling, masalan. %(offset)s, %(valid_value1)s, %(valid_value2)s va hokazo. %(limit_value)s

source: Enter a number.
uz: Raqam kiriting.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
uz: “%(extension)s” fayl kengaytmasiga ruxsat berilmagan. Ruxsat berilgan kengaytmalar: %(allowed_extensions)s.

source: Null characters are not allowed.
uz: Null belgilarga ruxsat berilmaydi.

source: and
uz: va

source: %(model_name)s with this %(field_labels)s already exists.
uz: %(model_name)s bilan bu %(field_labels)s allaqachon mavjud.

source: Constraint “%(name)s” is violated.
uz: “%(name)s” cheklovi buzilgan.

source: Value %(value)r is not a valid choice.
uz: %(value)r qiymati toʻgʻri emas.

source: This field cannot be null.
uz: Bu maydon null bo'lishi mumkin emas.

source: This field cannot be blank.
uz: Bu maydon boʻsh boʻlishi mumkin emas.

source: %(model_name)s with this %(field_label)s already exists.
uz: %(model_name)s bilan bu %(field_label)s allaqachon mavjud.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
uz: %(field_label)s %(date_field_label)s %(lookup_type)s uchun yagona bo‘lishi kerak.

source: Field of type: %(field_type)s
uz: Tur maydoni: %(field_type)s

source: “%(value)s” value must be either True or False.
uz: “%(value)s” qiymati True yoki False bo‘lishi kerak.

source: “%(value)s” value must be either True, False, or None.
uz: “%(value)s” qiymati True, False yoki None boʻlishi kerak.

source: Boolean (Either True or False)
uz: Mantiqiy (to'g'ri yoki noto'g'ri)

source: String (up to %(max_length)s)
uz: String (%(max_length)s gacha)

source: String (unlimited)
uz: String (cheksiz)

source: Comma-separated integers
uz: Vergul bilan ajratilgan butun sonlar

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
uz: “%(value)s” qiymati yaroqsiz sana formatiga ega. YYYY-MM-DD formatida bo'lishi kerak.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
uz: “%(value)s” qiymati to‘g‘ri formatga ega (YYYY-MM-DD), lekin bu sana noto‘g‘ri.

source: Date (without time)
uz: Sana (vaqtsiz)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
uz: “%(value)s” qiymati yaroqsiz formatga ega. YYYY-AA-KK HH:MM[:ss[.uuuuuu]][TZ] formatida bo'lishi kerak.

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
uz: “%(value)s” qiymati toʻgʻri formatga ega (YYYY-AA-DD HH:MM[:ss[.uuuuuu]][TZ]), lekin bu sana/vaqt yaroqsiz.

source: Date (with time)
uz: Sana (vaqt bilan)

source: “%(value)s” value must be a decimal number.
uz: “%(value)s” qiymati kasrli son boʻlishi kerak.

source: Decimal number
uz: O'nlik son

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
uz: “%(value)s” qiymati yaroqsiz formatga ega. U [DD] [[HH:]MM:]ss[.uuuuuu] formatida bo'lishi kerak.

source: Duration
uz: Davomiyligi

source: Email address
uz: E-pochta manzili

source: File path
uz: Fayl yo'li

source: “%(value)s” value must be a float.
uz: “%(value)s” qiymati float boʻlishi kerak.

source: Floating point number
uz: Suzuvchi nuqta raqami

source: “%(value)s” value must be an integer.
uz: “%(value)s” qiymati butun son bo‘lishi kerak.

source: Integer
uz: Butun son

source: Big (8 byte) integer
uz: Katta (8 bayt) butun son

source: Small integer
uz: Kichik butun son

source: IPv4 address
uz: IPv4 manzili

source: IP address
uz: IP manzili

source: “%(value)s” value must be either None, True or False.
uz: “%(value)s” qiymati Yoʻq, True yoki False boʻlishi kerak.

source: Boolean (Either True, False or None)
uz: Mantiqiy (to'g'ri, noto'g'ri yoki yo'q)

source: Positive big integer
uz: Musbat katta butun son

source: Positive integer
uz: Musbat butun son

source: Positive small integer
uz: Musbat kichik butun son

source: Slug (up to %(max_length)s)
uz: Slug (%(max_length)s gacha)

source: Text
uz: Matn

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
uz: “%(value)s” qiymati yaroqsiz formatga ega. U HH:MM[:ss[.uuuuuu]] formatida bo'lishi kerak.

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
uz: “%(value)s” qiymati to‘g‘ri formatga ega (HH:MM[:ss[.uuuuuu]]), lekin vaqt noto‘g‘ri.

source: Raw binary data
uz: Xom ikkilik ma'lumotlar

source: “%(value)s” is not a valid UUID.
uz: “%(value)s” yaroqli UUID emas.

source: Universally unique identifier
uz: Universal noyob identifikator

source: File
uz: Fayl

source: Image
uz: Rasm

source: A JSON object
uz: JSON obyekti

source: Value must be valid JSON.
uz: Qiymat haqiqiy JSON boʻlishi kerak.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
uz: %(field)s %(value)r bilan %(model)s misoli yaroqsiz.

source: Foreign Key (type determined by related field)
uz: Tashqi kalit (turi tegishli maydon bilan belgilanadi)

source: One-to-one relationship
uz: Birga-bir munosabat

source: %(from)s-%(to)s relationship
uz: %(from)s-%(to)s munosabati

source: %(from)s-%(to)s relationships
uz: %(from)s-%(to)s munosabatlari

source: Many-to-many relationship
uz: Ko'p-ko'p munosabatlari

source: This field is required.
uz: Ushbu qator to'ldirilishi shart.

source: Enter a whole number.
uz: Butun raqamni kiriting.

source: Enter a valid date.
uz: Yaroqli sanani kiriting.

source: Enter a valid time.
uz: Yaroqli vaqtni kiriting.

source: Enter a valid date/time.
uz: Yaroqli sana/vaqtni kiriting.

source: Enter a valid duration.
uz: Yaroqli muddatni kiriting.

source: The number of days must be between {min_days} and {max_days}.
uz: Kunlar soni {min_days} va {max_days} oralig'ida bo'lishi kerak.

source: No file was submitted. Check the encoding type on the form.
uz: Hech qanday fayl yuborilmadi. Shaklda kodlash turini tekshiring.

source: No file was submitted.
uz: Hech qanday fayl yuborilmadi.

source: The submitted file is empty.
uz: Yuborilgan fayl boʻsh.

source: Please either submit a file or check the clear checkbox, not both.
uz: Iltimos, faylni yuboring yoki ikkalasini ham emas, tozalash katakchasini belgilang.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
uz: Yaroqli rasm yuklang. Siz yuklagan fayl rasm yoki buzilgan rasm emas edi.

source: Select a valid choice. %(value)s is not one of the available choices.
uz: Yaroqli tanlovni tanlang. %(value)s mavjud variantlardan biri emas.

source: Enter a list of values.
uz: Qiymatlar ro'yxatini kiriting.

source: Enter a complete value.
uz: To'liq qiymatni kiriting.

source: Enter a valid UUID.
uz: Yaroqli UUID kiriting.

source: Enter a valid JSON.
uz: Yaroqli JSON kiriting.

source: (Hidden field %(name)s) %(error)s
uz: (Yashirin maydon %(name)s) %(xato)s %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
uz: ManagementForm maʼlumotlari yoʻq yoki oʻzgartirilgan. Yetishmayotgan maydonlar: %(field_names)s. Muammo davom etsa, xato hisobotini topshirishingiz kerak bo'lishi mumkin.

source: Order
uz: Buyurtma

source: Please correct the duplicate data for %(field)s.
uz: %(field)s uchun takroriy maʼlumotlarni toʻgʻrilang.

source: Please correct the duplicate data for %(field)s, which must be unique.
uz: %(field)s uchun takroriy maʼlumotlarni toʻgʻrilang, ular noyob boʻlishi kerak.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
uz: Iltimos, %(field_name)s uchun takroriy maʼlumotlarni toʻgʻrilang, ular %(lookup)s uchun %(date_field)s uchun yagona boʻlishi kerak.

source: Please correct the duplicate values below.
uz: Quyidagi takroriy qiymatlarni tuzating.

source: The inline value did not match the parent instance.
uz: Inline qiymat asosiy misolga mos kelmadi.

source: Select a valid choice. That choice is not one of the available choices.
uz: Yaroqli tanlovni tanlang. Bu tanlov mavjud variantlardan biri emas.

source: “%(pk)s” is not a valid value.
uz: “%(pk)s” yaroqli qiymat emas.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
uz: %(datetime)s vaqt mintaqasida %(current_timezone)s talqin qilinmadi; u noaniq bo'lishi yoki mavjud bo'lmasligi mumkin.

source: Currently
uz: Hozirda

source: Change
uz: O'zgartirish

source: Unknown
uz: Noma'lum

# Task
source: Ready
uz: Tayyor

# Task
source: Running
uz: Yugurish

# Task
source: Failed
uz: Muvaffaqiyatsiz

# Task
source: Successful
uz: Muvaffaqiyatli

source: yes,no,maybe
uz: ha, yo'q, ehtimol

source: p.m.
uz: soat

source: a.m.
uz: ertalab

source: midnight
uz: yarim tun

source: noon
uz: peshin

source: Monday
uz: dushanba

source: Tuesday
uz: seshanba

source: Wednesday
uz: chorshanba

source: Thursday
uz: Payshanba

source: Friday
uz: Juma

source: Saturday
uz: shanba

source: Sunday
uz: yakshanba

source: Mon
uz: dus

source: Tue
uz: Seshanba

source: Wed
uz: Chorshanba

source: Thu
uz: Pays

source: Fri
uz: Juma

source: Sat
uz: Shanba

source: Sun
uz: Quyosh

source: January
uz: Yanvar

source: February
uz: Fevral

source: March
uz: mart

source: April
uz: aprel

source: June
uz: iyun

source: July
uz: iyul

source: August
uz: avgust

source: September
uz: sentyabr

source: October
uz: oktyabr

source: November
uz: noyabr

source: December
uz: dekabr

source: feb
uz: fevral

source: may
uz: mumkin

source: jun
uz: iyun

source: jul
uz: iyul

source: aug
uz: avgust

source: sep
uz: sen

source: oct
uz: okt

source: nov
uz: noyabr

source: dec
uz: dek

# abbrev. month
source: Jan.
uz: Yanvar

# abbrev. month
source: Feb.
uz: Fevral

# abbrev. month
source: March
uz: mart

# abbrev. month
source: April
uz: aprel

# abbrev. month
source: June
uz: iyun

# abbrev. month
source: July
uz: iyul

# abbrev. month
source: Aug.
uz: avgust

# abbrev. month
source: Sept.
uz: sentabr

# abbrev. month
source: Oct.
uz: Oktyabr

# abbrev. month
source: Nov.
uz: Noyabr

# abbrev. month
source: Dec.
uz: dekabr

# alt. month
source: January
uz: Yanvar

# alt. month
source: February
uz: Fevral

# alt. month
source: March
uz: mart

# alt. month
source: April
uz: aprel

# alt. month
source: June
uz: iyun

# alt. month
source: July
uz: iyul

# alt. month
source: August
uz: avgust

# alt. month
source: September
uz: sentyabr

# alt. month
source: October
uz: oktyabr

# alt. month
source: November
uz: noyabr

# alt. month
source: December
uz: dekabr

source: This is not a valid IPv6 address.
uz: Bu haqiqiy IPv6 manzili emas.

source: or
uz: yoki

source: Forbidden
uz: Taqiqlangan

source: CSRF verification failed. Request aborted.
uz: CSRF tekshiruvi amalga oshmadi. So‘rov bekor qilindi.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
uz: Siz ushbu xabarni ko'ryapsiz, chunki ushbu HTTPS sayti veb-brauzeringiz tomonidan yuborilishi uchun “Referer sarlavhasi”ni talab qiladi, lekin hech biri yuborilmadi. Ushbu sarlavha brauzeringiz uchinchi shaxslar tomonidan o'g'irlanmasligini ta'minlash uchun xavfsizlik nuqtai nazaridan talab qilinadi.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
uz: Agar siz brauzeringizni “Referer” sarlavhalarini o‘chirishga sozlagan bo‘lsangiz, iltimos, ularni hech bo‘lmaganda ushbu sayt yoki HTTPS ulanishlari yoki “bir xil kelib chiqishi” so‘rovlari uchun qayta yoqing.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
uz: Agar siz <meta name="referrer" content="no-referrer"> tegidan foydalanayotgan bo'lsangiz yoki "Referrer-Policy: no-referrer" sarlavhasini qo'shsangiz, ularni olib tashlang. CSRF himoyasi "Referer" sarlavhasini qat'iy referer tekshiruvini o'tkazishni talab qiladi. Maxfiylik haqida qayg'urayotgan bo'lsangiz, uchinchi tomon saytlariga havolalar uchun <a rel="noreferrer" …> kabi alternativlardan foydalaning.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
uz: Siz ushbu xabarni ko'ryapsiz, chunki bu sayt shakllarni yuborishda CSRF cookie-faylini talab qiladi. Ushbu cookie brauzeringiz uchinchi shaxslar tomonidan o'g'irlanmasligini ta'minlash uchun xavfsizlik nuqtai nazaridan talab qilinadi.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
uz: Agar siz brauzeringizni cookie-fayllarni o'chirib qo'yadigan qilib sozlagan bo'lsangiz, iltimos, ularni hech bo'lmaganda ushbu sayt uchun yoki "bir xil kelib chiqishi" so'rovlari uchun qayta yoqing.

source: More information is available with DEBUG=True.
uz: Qo'shimcha ma'lumotni DEBUG=True orqali olish mumkin.

source: No year specified
uz: Yil belgilanmagan

source: Date out of range
uz: Sana diapazondan tashqarida

source: No month specified
uz: Oy belgilanmagan

source: No day specified
uz: Kun belgilanmagan

source: No week specified
uz: Hafta belgilanmagan

source: No %(verbose_name_plural)s available
uz: Hech qanday %(verbose_name_plural)s mavjud emas

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
uz: Kelajakdagi %(verbose_name_plural)s mavjud emas, chunki %(class_name)s.allow_future False.

source: Invalid date string “%(datestr)s” given format “%(format)s”
uz: Yaroqsiz sana qatori “%(datestr)s” berilgan “%(format)s” formatida

source: No %(verbose_name)s found matching the query
uz: Soʻrovga mos keladigan %(verbose_name) topilmadi %(verbose_name)s

source: Page is not “last”, nor can it be converted to an int.
uz: Sahifa "oxirgi" emas va uni int ga aylantirib bo'lmaydi.

source: Invalid page (%(page_number)s): %(message)s
uz: Yaroqsiz sahifa (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
uz: Boʻsh roʻyxat va “%(class_name)s.allow_empty” notoʻgʻri.

source: Directory indexes are not allowed here.
uz: Bu yerda katalog indekslariga ruxsat berilmaydi.

source: “%(path)s” does not exist
uz: “%(path)s” mavjud emas

source: Index of %(directory)s
uz: %(katalog)s indeksi %(directory)s

source: The install worked successfully! Congratulations!
uz: O'rnatish muvaffaqiyatli ishladi! Tabriklaymiz!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
uz: Django %(version)s uchun <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">nashr qaydlarini</a> ko‘rish

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
uz: Siz bu sahifani ko'ryapsiz, chunki <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> sozlamalar faylida joylashgan va siz hech qanday URL manzilini sozlamagansiz.

source: Django Documentation
uz: Django hujjatlari

source: Topics, references, &amp; how-to’s
uz: Mavzular, havolalar, & amp; qanday qilish kerak

source: Tutorial: A Polling App
uz: Qo'llanma: So'rovnoma uchun ilova

source: Get started with Django
uz: Django bilan boshlang

source: Django Community
uz: Django hamjamiyati

source: Connect, get help, or contribute
uz: Ulanish, yordam olish yoki hissa qo‘shish
