Repository: itsafzalbe/PersonalFinanceTracker
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: English
uz: Ingliz

source: Russian
uz: rus

source: Uzbek
uz: o'zbek

source: Change Password
uz: Parolni o'zgartirish

source: Update your account password
uz: Hisobingiz parolini yangilang

source: Current Password
uz: Joriy parol

source: New Password
uz: Yangi parol

source: At least 8 characters
uz: Kamida 8 ta belgi

source: Confirm New Password
uz: Yangi parolni tasdiqlang

source: Update Password
uz: Parolni yangilash

source: Cancel
uz: Bekor qilish

source: Password Security Tips
uz: Parol xavfsizligi bo'yicha maslahatlar

source: Use at least 8 characters
uz: Kamida 8 ta belgidan foydalaning

source: Mix uppercase and lowercase letters
uz: Katta va kichik harflarni aralashtiring

source: Include numbers and special characters
uz: Raqamlar va maxsus belgilarni qo'shing

source: Avoid common words or personal information
uz: Umumiy so'zlardan yoki shaxsiy ma'lumotlardan saqlaning

source: Don't reuse passwords from other sites
uz: Boshqa saytlardan parollarni qayta ishlatmang

source: Complete Registration
uz: Roʻyxatdan oʻtish

source: Complete Your Profile
uz: Profilingizni toʻldiring

source: Just a few more details to get started
uz: Boshlash uchun yana bir nechta tafsilotlar

source: Username
uz: Foydalanuvchi nomi

source: First Name
uz: Ism

source: Last Name
uz: Familiya

source: Password
uz: Parol

source: Confirm Password
uz: Parolni tasdiqlang

source: Phone Number
uz: Telefon raqami

source: Date of Birth
uz: Tug'ilgan kuni

source: Login
uz: Tizimga kirish

source: Welcome Back!
uz: Qaytib kelganingizdan xursandmiz!

source: Login to manage your finances
uz: Moliyangizni boshqarish uchun tizimga kiring

source: Username or Email
uz: Foydalanuvchi nomi yoki elektron pochta

source: Don't have an account?
uz: Hisobingiz yo'qmi?

source: Sign up
uz: Ro'yxatdan o'tish

source: Encrypted
uz: Shifrlangan

source: Secure
uz: Xavfsiz

source: Private
uz: Shaxsiy

source: Profile
uz: Profil

source: My Profile
uz: Mening profilim

source: Manage your account settings
uz: Hisobingiz sozlamalarini boshqaring

source: Profile Information
uz: Profil haqida ma'lumot

source: Edit Profile
uz: Profilni tahrirlash

source: Email
uz: Elektron pochta

source: Full Name
uz: To'liq ism

source: Not provided
uz: Taqdim etilmaydi

source: Default Currency
uz: Standart valyuta

source: Member Since
uz: dan beri a'zo

source: Account Status
uz: Hisob holati

source: Security
uz: Xavfsizlik

source: Danger Zone
uz: Xavfli zona

source: Once you delete your account, there is no going back. Please be certain.
uz: Hisobingizni o'chirib tashlaganingizdan so'ng, orqaga qaytib bo'lmaydi. Iltimos, ishonch hosil qiling.

source: Delete Account
uz: Hisobni o'chirish

source: Are you sure you want to delete your account? This action cannot be undone.
uz: Hisobingizni oʻchirib tashlamoqchimisiz? Bu amalni ortga qaytarib bo‘lmaydi.

source: All your data including cards, transactions, and budgets will be permanently deleted.
uz: Barcha maʼlumotlaringiz, jumladan, kartalar, tranzaksiyalar va byudjetlar butunlay oʻchirib tashlanadi.

source: Enter your password to confirm
uz: Tasdiqlash uchun parolingizni kiriting

source: Delete My Account
uz: Mening hisobimni o'chirish

source: Sign Up
uz: Ro'yxatdan o'tish

source: Create Your Account
uz: Hisobingizni yarating

source: Start tracking your finances today
uz: Moliyaviy ahvolingizni bugun kuzatishni boshlang

source: Email Address
uz: E-pochta manzili

source: We'll send you a verification code
uz: Sizga tasdiqlash kodini yuboramiz

source: Send Verification Code
uz: Tasdiqlash kodini yuboring

source: Already have an account?
uz: Hisobingiz bormi?

source: Secure & Private
uz: Xavfsiz va shaxsiy

source: Track Expenses
uz: Xarajatlarni kuzatish

source: Save Money
uz: Pulni tejash

source: Update Profile
uz: Profilni yangilash

source: Manage your personal information
uz: Shaxsiy ma'lumotlaringizni boshqaring

source: Save Changes
uz: O'zgarishlarni saqlash

source: Verify Email - Finance Tracker
uz: Elektron pochtani tekshiring - Moliyaviy kuzatuvchi

source: Verify Your Email
uz: Elektron pochtangizni tasdiqlang

source: We've sent a 4-digit code to
uz: Biz 4 xonali kodni yubordik

source: Verification Code
uz: Tasdiq kodi

source: Code expires in 2 minutes
uz: Kod 2 daqiqada tugaydi

source: Verify Code
uz: Kodni tekshiring

source: Resend Code
uz: Kodni qayta yuborish

source: Please wait 2 minutes before requesting a new code
uz: Yangi kod soʻrashdan oldin 2 daqiqa kuting

source: Wrong email?
uz: Noto'g'ri elektron pochtami?

source: Start over
uz: Qaytadan boshlang

source: Statistics
uz: Statistika

source: Logout
uz: Chiqish

source: Dashboard
uz: Boshqaruv paneli

source: Transactions
uz: Bitimlar

source: Cards / Wallets
uz: Kartalar / hamyonlar

source: Budgets
uz: Byudjetlar

source: Transfers
uz: Transferlar

source: Support Chats
uz: Yordam chatlari

source: Member since
uz: beri a'zo

source: Active Budgets
uz: Faol byudjetlar

source: All Budgets
uz: Barcha byudjetlar

source: View
uz: Ko‘rish

source: No Active Budgets
uz: Faol byudjetlar yo'q

source: Create Budget
uz: Byudjet yaratish

source: Budget Alerts
uz: Byudjet ogohlantirishlari

source: Budgets requiring attention
uz: E'tibor talab qiladigan byudjetlar

source: View Budget
uz: Byudjetni ko'rish

source: All Clear!
uz: Hammasi aniq!

source: No budget alerts at the moment. You're doing great!
uz: Ayni paytda byudjet haqida ogohlantirishlar yo'q. Siz ajoyib ishlayapsiz!

source: View All Budgets
uz: Barcha byudjetlarni ko'rish

source: Budgets by Category
uz: Turkum bo'yicha byudjetlar

source: View budgets organized by spending category
uz: Xarajatlar toifasi boʻyicha tuzilgan byudjetlarni koʻring

source: Back to List
uz: Roʻyxatga qaytish

source: View Details
uz: Tafsilotlarni ko'rish

source: No Budgets Found
uz: Hech qanday byudjet topilmadi

source: Create your first budget to get started.
uz: Boshlash uchun birinchi byudjetingizni yarating.

source: Budgets by Period
uz: Davrlar bo'yicha byudjetlar

source: View budgets organized by time period
uz: Vaqt davri bo'yicha tuzilgan byudjetlarni ko'rish

source: Weekly Budgets
uz: Haftalik byudjetlar

source: Monthly Budgets
uz: Oylik byudjetlar

source: Yearly Budgets
uz: Yillik byudjetlar

source: Create budgets to track your spending over time.
uz: Vaqt o'tishi bilan xarajatlaringizni kuzatish uchun byudjet yarating.

source: Delete Budget
uz: Byudjetni o'chirish

source: This will permanently delete this budget. This action cannot be undone!
uz: Bu budjetni butunlay o‘chirib tashlaydi. Bu amalni ortga qaytarib bo‘lmaydi!

source: Budget:
uz: Byudjet:

source: Period:
uz: Davr:

source: Category:
uz: Turkum:

source: Yes, Delete Budget
uz: Ha, budjetni oʻchirish

source: Edit
uz: Tahrirlash

source: Budget Progress
uz: Byudjet taraqqiyoti

source: Spent:
uz: Sarflangan:

source: Remaining:
uz: Qolgan:

source: Over Budget!
uz: Byudjetdan ortiq!

source: Details
uz: Tafsilotlar

source: Category
uz: Turkum

source: Period
uz: Davr

source: Currency
uz: Valyuta

source: Alert At
uz: Ogohlantirish

source: Active
uz: Faol

source: Inactive
uz: Faol emas

source: Actions
uz: Harakatlar

source: View Progress
uz: Jarayonni ko‘rish

source: Spending History
uz: Sarflash tarixi

source: Deactivate
uz: Faolsizlantirish

source: Activate
uz: Faollashtirish

source: Budget
uz: Byudjet

source: Budget Name
uz: Byudjet nomi

source: Budget Amount
uz: Byudjet miqdori

source: Alert Threshold
uz: Ogohlantirish chegarasi

source: Get notified when you reach this percentage of your budget
uz: Byudjetingizning shu foiziga yetganingizda bildirishnoma oling

source: Track spending against this budget
uz: Ushbu byudjetga nisbatan xarajatlarni kuzatib boring

source: Plan and track your spending limits
uz: Xarajat chegaralarini rejalashtiring va kuzatib boring

source: Overview
uz: Umumiy koʻrinish

source: Active Only
uz: Faqat faol

source: Alerts
uz: Ogohlantirishlar

source: By Category
uz: Kategoriya bo'yicha

source: All Periods
uz: Barcha davrlar

source: Weekly
uz: Haftalik

source: Monthly
uz: Oylik

source: Yearly
uz: Yillik

source: All Status
uz: Barcha holat

source: Filter
uz: Filtr

source: Progress
uz: Taraqqiyot

source: Delete
uz: Oʻchirish

source: Spent
uz: Sarflangan

source: %% used
uz: %% foydalanilgan

source: left
uz: chap

source: Previous
uz: Oldingi

source: Next
uz: Keyingisi

source: No Budgets Yet
uz: Hozircha byudjet yo'q

source: Start managing your spending by creating your first budget.
uz: Birinchi byudjetingizni yaratish orqali xarajatlaringizni boshqarishni boshlang.

source: Create Your First Budget
uz: Birinchi byudjetingizni yarating

source: Budget Overview
uz: Byudjetga umumiy nuqtai

source: See all your budgets at a glance
uz: Barcha byudjetlaringizni bir qarashda ko'ring

source: Back
uz: Orqaga

source: Total Budgeted
uz: Jami byudjet

source: Total Spent
uz: Jami sarflangan

source: Remaining
uz: Qolgan

source: Total
uz: Jami

source: Overall Budget Progress
uz: Umumiy byudjet taraqqiyoti

source: over budget
uz: byudjetdan ortiq

source: at warning
uz: ogohlantirishda

source: Progress Report
uz: Taraqqiyot hisoboti

source: Over Budget
uz: Byudjetdan ortiq

source: Warning
uz: Ogohlantirish

source: On Track
uz: Yo'lda

source: Good
uz: Yaxshi

source: Period Timeline
uz: Davr xronologiyasi

source: days remaining
uz: qolgan kunlar

source: Spending Analysis
uz: Xarajatlar tahlili

source: Average Daily Spending
uz: O'rtacha kunlik xarajatlar

source: Suggested Daily Limit
uz: Tavsiya etilgan kunlik chegara

source: • Past
uz: • O‘tgan

source: months
uz: oylar

source: 3 Months
uz: 3 oy

source: 6 Months
uz: 6 oy

source: 12 Months
uz: 12 oy

source: Current Budget
uz: Joriy byudjet

source: Historical Spending
uz: Tarixiy xarajatlar

source: Average Monthly Spending
uz: O'rtacha oylik xarajatlar

source: Times Over Budget
uz: Byudjetdan ortiq vaqt

source: Months Tracked
uz: Oylar kuzatildi

source: No Historical Data
uz: Tarixiy ma'lumotlar yo'q

source: No spending history found for this budget category in the selected time period.
uz: Tanlangan vaqt oralig‘ida ushbu byudjet toifasi uchun sarflangan mablag‘lar tarixi topilmadi.

source: Back to Budget
uz: Byudjet sahifasiga qaytish

source: Card Types
uz: Karta turlari

source: Available card types for your wallets
uz: Hamyonlaringiz uchun mavjud karta turlari

source: Back to Cards
uz: Kartalar sahifasiga qaytish

source: No Card Types Available
uz: Hech qanday karta turlari mavjud emas

source: There are no active card types at the moment.
uz: Hozirda faol karta turlari mavjud emas.

source: About Card Types
uz: Karta turlari haqida

source: Card types help you categorize your payment methods:
uz: Karta turlari to'lov usullarini tasniflashda yordam beradi:

source: International payment cards
uz: Xalqaro to'lov kartalari

source: Local Uzbekistan payment cards
uz: Mahalliy O'zbekiston to'lov kartalari

source: Online payment services (PayPal, Click, etc.)
uz: Onlayn to'lov xizmatlari (PayPal, Click va boshqalar)

source: Direct bank account access
uz: To'g'ridan-to'g'ri bank hisobiga kirish

source: Change Card Status
uz: Karta holatini o'zgartirish

source: Blocked
uz: Bloklangan

source: Update
uz: Yangilash

source: Delete Card
uz: Kartani o'chirish

source: Cards & Wallets
uz: Kartalar va hamyonlar

source: Cannot Delete Card
uz: Kartani oʻchirib boʻlmadi

source: Go Back
uz: Ortga qaytish

source: Are you sure?
uz: Ishonchingiz komilmi?

source: This action cannot be undone!
uz: Bu amalni ortga qaytarib bo‘lmaydi!

source: Card to be deleted:
uz: O'chirilishi kerak bo'lgan karta:

source: Name:
uz: Nomi:

source: Balance:
uz: Balans:

source: Last 4:
uz: Oxirgi 4:

source: Warning:
uz: Ogohlantirish:

source: Deleting this card will permanently remove it from your account. This action cannot be reversed.
uz: Bu kartani oʻchirib tashlasangiz, u hisobingizdan butunlay oʻchirib tashlanadi. Bu harakatni qaytarib bo'lmaydi.

source: Yes, Delete Card
uz: Ha, kartani o'chirish

source: Consider these alternatives:
uz: Ushbu alternativalarni ko'rib chiqing:

source: Set the card status to
uz: Karta holatini sozlang

source: instead of deleting
uz: o'chirish o'rniga

source: Mark it as
uz: Uni belgilang

source: if it's lost or stolen
uz: agar u yo'qolgan yoki o'g'irlangan bo'lsa

source: Keep the card for historical transaction records
uz: Tarixiy tranzaksiya yozuvlari uchun kartani saqlang

source: Default
uz: Standart

source: Edit Card
uz: Kartani tahrirlash

source: Card Number
uz: Karta raqami

source: Current Balance
uz: Joriy balans

source: This Month's Activity
uz: Bu oylik faoliyat

source: Income
uz: Daromad

source: Expenses
uz: Xarajatlar

source: Recent Transactions
uz: Oxirgi operatsiyalar

source: View All
uz: Hammasini ko‘rish

source: No transactions yet
uz: Hozircha tranzaksiya yo‘q

source: Quick Actions
uz: Tezkor harakatlar

source: Update Balance
uz: Balansni yangilash

source: Add Transaction
uz: Tranzaksiya qo'shish

source: Set as Default
uz: Standart sifatida sozlash

source: Card Details
uz: Karta tafsilotlari

source: Card Name
uz: Karta nomi

source: Card Type
uz: Karta turi

source: Last 4 Digits
uz: Oxirgi 4 ta raqam

source: Created
uz: Yaratilgan

source: Default Card
uz: Standart karta

source: Yes
uz: Ha

source: No
uz: Yo'q

source: Change Status
uz: Statusni o'zgartirish

source: Update Status
uz: Statusni yangilash

source: Permanently delete this card
uz: Ushbu kartani butunlay o'chirib tashlang

source: Give your card a memorable name (e.g., \
uz: Kartangizga esda qolarli nom bering (masalan, \

source: Bank Name
uz: Bank nomi

source: Initial Balance
uz: Dastlabki balans

source: Last 4 digits of your card number (for identification)
uz: Karta raqamingizning oxirgi 4 ta raqami (identifikatsiya qilish uchun)

source: Tips
uz: Maslahatlar

source: Choose a descriptive name for easy identification
uz: Oson identifikatsiya qilish uchun tavsiflovchi nom tanlang

source: Select the correct currency to avoid conversion issues
uz: Konvertatsiya bilan bog'liq muammolarni oldini olish uchun to'g'ri valyutani tanlang

source: Enter your current balance accurately
uz: Joriy balansingizni aniq kiriting

source: You can always update the balance later
uz: Balansni keyinroq har doim yangilashingiz mumkin

source: Set status to \
uz: Holatni \ ga o'rnatish

source: Manage your payment cards and digital wallets
uz: Toʻlov kartalari va raqamli hamyonlarni boshqaring

source: Add New Card
uz: Yangi karta qo'shing

source: Total Balance
uz: Umumiy balans

source: Active Cards
uz: Faol kartalar

source: Cards
uz: Kartalar

source: Total Cards
uz: Jami kartalar

source: All cards
uz: Barcha kartalar

source: No Cards Yet
uz: Hali kartalar yo'q

source: No cards match your filters. Try adjusting your search criteria.
uz: Filtringizga mos keladigan kartalar topilmadi. Qidiruv mezonlarini o'zgartirishga harakat qiling.

source: Start by adding your first payment card or digital wallet to track your finances.
uz: Moliyangizni kuzatish uchun birinchi toʻlov kartangizni yoki raqamli hamyonni qoʻshishdan boshlang.

source: Add Your First Card
uz: Birinchi kartangizni qo'shing

source: Clear Filters
uz: Filtrlarni tozalash

source: Convert Currency
uz: Valyutani konvertatsiya qilish

source: View Currencies
uz: Valyutalarni ko'rish

source: Balance Updated!
uz: Balans yangilandi!

source: Your card balance has been successfully updated.
uz: Karta balansingiz muvaffaqiyatli yangilandi.

source: Old Balance
uz: Eski balans

source: New Balance
uz: Yangi balans

source: Difference
uz: Farq

source: Reason
uz: Sabab

source: View Card
uz: Kartani ko'rish

source: All Cards
uz: Barcha kartalar

source: Enter the new balance for this card
uz: Ushbu karta uchun yangi balansni kiriting

source: Reason (Optional)
uz: Sabab (ixtiyoriy)

source: Why are you updating the balance?
uz: Nega balansni yangilayapsiz?

source: Note
uz: Eslatma

source: This will directly update your card balance. Use the transactions feature to properly record income or expenses.
uz: Bu to'g'ridan-to'g'ri kartangiz balansini yangilaydi. Daromad yoki xarajatlarni to'g'ri qayd qilish uchun tranzaktsiyalar xususiyatidan foydalaning.

source: Categories
uz: Kategoriyalar

source: Organize your transactions
uz: Tranzaktsiyalaringizni tashkil qiling

source: Add Category
uz: Kategoriya qo'shish

source: Total Categories
uz: Jami toifalar

source: Income Categories
uz: Daromad toifalari

source: Expense Categories
uz: Xarajatlar toifalari

source: All Types
uz: Barcha turlari

source: Expense
uz: Xarajat

source: Search categories...
uz: Kategoriyalarni qidirish...

source: System
uz: Tizim

source: Custom
uz: Maxsus

source: No categories found
uz: Hech qanday toifa topilmadi

source: Currencies
uz: Valyutalar

source: Convert
uz: Konvertatsiya qilish

source: Currency Converter
uz: Valyuta konvertori

source: Convert between different currencies
uz: Turli valyutalar o'rtasida konvertatsiya qilish

source: Amount
uz: Miqdori

source: From Currency
uz: Valyutadan

source: Swap
uz: Almashtirish

source: To Currency
uz: Valyutaga

source: Conversion Result
uz: Konvertatsiya natijasi

source: From
uz: Kimdan

source: To
uz: Kimga

source: Exchange Rate:
uz: Valyuta kursi:

source: Popular Conversions
uz: Ommabop konversiyalar

source: View all supported currencies
uz: Barcha qo'llab-quvvatlanadigan valyutalarni ko'ring

source: Search by code or name...
uz: Kod yoki ism bo'yicha qidirish...

source: Search
uz: Qidiruv

source: Code
uz: Kod

source: Name
uz: Ism

source: Symbol
uz: Belgi

source: No Currencies Found
uz: Hech qanday valyuta topilmadi

source: Try adjusting your search criteria.
uz: Qidiruv mezonlarini o'zgartirishga harakat qiling.

source: Clear Search
uz: Qidiruvni tozalash

source: About Currencies
uz: Valyutalar haqida

source: These are the currencies supported by our system. You can use them when creating cards and wallets.
uz: Bu bizning tizimimiz tomonidan qo'llab-quvvatlanadigan valyutalar. Siz ularni kartalar va hamyonlarni yaratishda ishlatishingiz mumkin.

source: Exchange rates are updated regularly to provide accurate conversions.
uz: To'g'ri konvertatsiya qilish uchun valyuta kurslari muntazam yangilanadi.

source: Welcome back
uz: qaytib kelganingizdan xursandmiz

source: Here's your financial overview
uz: Mana sizning moliyaviy sharhingiz

source: Add Card
uz: Karta qo'shish

source: View Statistics
uz: Statistikani ko'rish

source: No budgets yet
uz: Hozircha byudjet yo'q

source: Track Your Money. Control Your Life.
uz: Pulingizni kuzatib boring. Hayotingizni boshqaring.

source: Simple. Secure. Smart personal finance tracking.
uz: Oddiy. Xavfsiz. Shaxsiy moliyani aqlli kuzatish.

source: Get Started
uz: Boshlash

source: Financial Statistics
uz: Moliyaviy statistika

source: Your financial overview and insights
uz: Sizning moliyaviy nuqtai nazaringiz va tushunchalaringiz

source: Monthly Income
uz: Oylik daromad

source: Monthly Expenses
uz: Oylik xarajatlar

source: Net Savings
uz: Sof tejash

source: Account Overview
uz: Hisobga umumiy nuqtai

source: This Month
uz: Shu oy

source: Net Balance
uz: Net balans

source: Want more detailed insights?
uz: Batafsil ma'lumot olishni xohlaysizmi?

source: View Charts
uz: Diagrammalarni ko'rish

source: Export Data
uz: Ma'lumotlarni eksport qilish

source: Back to Dashboard
uz: Boshqaruv paneli sahifasiga qaytish

source: Chat with
uz: bilan suhbatlashing

source: No messages yet.
uz: Hali hech qanday xabar yo'q.

source: Send
uz: Yuborish

source: Admin Support Chats
uz: Administratorni qo'llab-quvvatlash suhbatlari

source: No messages yet
uz: Hali hech qanday xabar yo'q

source: Open
uz: Ochiq

source: No support messages yet.
uz: Hozircha qoʻllab-quvvatlash xabarlari yoʻq.

source: Support Chat
uz: Yordam chat

source: Get help from our support team
uz: Bizning qo'llab-quvvatlash guruhimizdan yordam oling

source: Support Team
uz: Yordam jamoasi

source: No messages yet. Start a conversation!
uz: Hali hech qanday xabar yo'q. Suhbatni boshlang!

source: Send Message
uz: Xabar yuborish

source: Delete Transaction?
uz: Tranzaksiya oʻchirilsinmi?

source: Transaction Details:
uz: Tranzaksiya tafsilotlari:

source: Title:
uz: Sarlavha:

source: Amount:
uz: Miqdori:

source: Date:
uz: Sana:

source: Yes, Delete
uz: Ha, o'chirish

source: Type
uz: Turi

source: Card/Wallet
uz: Karta/hamyon

source: Date
uz: Sana

source: Description
uz: Tavsif

source: Location
uz: Joylashuv

source: Edit Transaction
uz: Tranzaksiyani tahrirlash

source: Delete Transaction
uz: Tranzaksiyani oʻchirish

source: Title
uz: Sarlavha

source: Tags
uz: Teglar

source: Select tags for this transaction:
uz: Ushbu tranzaksiya uchun teglarni tanlang:

source: Business
uz: Biznes

source: Personal
uz: Shaxsiy

source: Manage tags
uz: Teglarni boshqarish

source: This is a recurring transaction
uz: Bu takrorlanuvchi tranzaksiya

source: Choose \
uz: tanlang \

source: Select the appropriate card/wallet used
uz: Amaldagi tegishli karta/hamyonni tanlang

source: Pick a category that best describes the transaction
uz: Tranzaktsiyani eng yaxshi tavsiflovchi toifani tanlang

source: Add location and description for better tracking
uz: Yaxshiroq kuzatish uchun joylashuv va tavsif qo'shing

source: Track your income and expenses
uz: Daromad va xarajatlaringizni kuzatib boring

source: Total Income
uz: Jami daromad

source: Total Expenses
uz: Jami xarajatlar

source: Total Transactions
uz: Jami tranzaktsiyalar

source: All time
uz: Hamma vaqt

source: All Categories
uz: Barcha toifalar

source: Card
uz: Karta

source: Start Date
uz: Boshlanish sanasi

source: End Date
uz: Tugash sanasi

source: Clear
uz: Toza

source: selected
uz: tanlangan

source: Delete Selected
uz: Tanlanganni o'chirish

source: First
uz: Birinchidan

source: Last
uz: Oxirgi

source: No Transactions Yet
uz: Hozircha tranzaktsiyalar yoʻq

source: No transactions match your filters. Try adjusting your search criteria.
uz: Hech qanday tranzaksiya filtrlaringizga mos kelmaydi. Qidiruv mezonlarini o'zgartirishga harakat qiling.

source: Start tracking your finances by adding your first transaction.
uz: Birinchi tranzaksiyani qo'shish orqali moliyangizni kuzatishni boshlang.

source: Add Your First Transaction
uz: Birinchi tranzaktsiyangizni qo'shing

source: Transaction Statistics
uz: Tranzaktsiyalar statistikasi

source: Analyze your financial data
uz: Moliyaviy ma'lumotlaringizni tahlil qiling

source: Back to Transactions
uz: Tranzaksiyalar sahifasiga qaytish

source: Today
uz: Bugun

source: This Week
uz: Ushbu hafta

source: This Year
uz: Bu yil

source: Top Expense Categories
uz: Eng yaxshi xarajat toifalari

source: No expense data
uz: Xarajat ma'lumotlari yo'q

source: Top Income Categories
uz: Yuqori daromad toifalari

source: No income data
uz: Daromad ma'lumotlari yo'q

source: Transfer Between Cards
uz: Kartalar o'rtasida o'tkazma

source: Transfer between ANY currencies - USD, EUR, UZS, and more!
uz: HAR QANDAY valyutalar o'rtasida o'tkazma - USD, EUR, SO'M va boshqalar!

source: Multi-Currency Support
uz: Ko'p valyutali qo'llab-quvvatlash

source: Transfer from USD to UZS, EUR to USD, UZS to EUR - any combination! Automatic conversion at current rates.
uz: AQSH dollaridan soʻmga, yevrodan dollarga, soʻmdan yevroga oʻtkazma – istalgan kombinatsiya! Joriy tariflar bo'yicha avtomatik konvertatsiya.

source: From Card (Any Currency)
uz: Kartadan (har qanday valyuta)

source: Converting...
uz: Oʻzgartirilmoqda...

source: To Card (Any Currency)
uz: Kartaga (har qanday valyuta)

source: Amount to Transfer
uz: O'tkazish uchun summa

source: Multi-Currency Transfer Preview
uz: Ko'p valyutali o'tkazmalarni oldindan ko'rish

source: You Send
uz: Siz yuborasiz
